# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример: - для k = 8 список будет выглядеть так: 
# [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21] [Негафибоначчи]

list1 = []
list2 = []
x = int(input('Введите целое число х = '))
f1 = 1
f2 = 0
f3 = 0
for i in range(0, x):
    f3 = f1 - f2
    f1 = f2
    f2 = f3
    list1.append(f2)
list1.reverse()
list1.append(0)
f1 = 1
f2 = 1
f3 = 0
list2 = [1, 1]
for i in range(2, x):
    f3 = f1 + f2
    f1 = f2
    f2 = f3
    list2.append(f2)
print(list1 + list2)